       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN.
       AUTHOR. Xinyan ZHAO.
       INSTALLATION. WIN10.
       DATE-WRITTEN.09/01/19.
       DATE-COMPILED. 16/01/19.
       SECURITY. LOCAL.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT EMPLOYEES ASSIGN TO 'employees.txt'
               ORGANIZATION IS LINE SEQUENTIAL
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS EMPLOYEE-STATUS.

           SELECT RECORDTST ASSIGN TO 'receodtst.dat'
               ORGANIZATION IS INDEXED
               ACCESS MODE IS RANDOM
               RECORD KEY IS EMPLOYEEREC-ID
               FILE STATUS IS RECORDTST-STATUS.

           SELECT ATTENDANCE ASSIGN TO 'attendance.txt'
               ORGANIZATION IS LINE SEQUENTIAL
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS ATTENDANCE-STATUS.

           SELECT MONTHLY-ATTENDANO 
               ASSIGN TO 'monthly-attendancecob.txt'
               ORGANIZATION IS LINE SEQUENTIAL
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS MONTHLY-ATTENDANCE-STATUS.
           SELECT MONTHLY-ATTENDANCE
               ASSIGN TO 'monthly-attendance.txt'
               ORGANIZATION IS LINE SEQUENTIAL
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS MONTHLY-ATTENDANCE-STATUS.           
           SELECT SUMMARY ASSIGN TO 'summarycob.txt'
               ORGANIZATION IS LINE SEQUENTIAL
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS SUMMARY-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD EMPLOYEES.
       01 EMPLOYEE-INFORMATION.
           05 EMPLOYEE-ID PIC 9999.
           05 EMPLOYEE-NAME.
               10 EMPLOYEE-LAST-NAME PIC X(10) VALUE SPACES.
               10 EMPLOYEE-FIRST-NAME PIC X(20) VALUE SPACES.
           05 EMPLOYEE-GENDER PIC X VALUE SPACES.
           05 EMPLOYEE-BIRTH PIC 9999X99X99.
           05 EMPLOYEE-HIRING-DATE PIC 9999X99X99.
           05 EMPLOYEE-DEPART PIC XXX VALUE SPACES.
           05 EMPLOYEE-SALARY PIC 9(6).

       FD RECORDTST.
       01 EMPLOYEEREC.
           05 EMPLOYEEREC-DATE PIC 9999X99X99.
           05 EMPLOYEEREC-ID PIC 9999.
           05 EMPLOYEEREC-LASTNAME PIC X(10) VALUE SPACES.
           05 EMPLOYEEREC-FIRSTNAME PIC X(20) VALUE SPACES.
           05 EMPLOYEEREC-DEPART PIC XXX VALUE SPACES.
           05 EMPLOYEEREC-ARRIVE PIC 9 .
           05 EMPLOYEEREC-LEAVE PIC 9.
           05 EMPLOYEEREC-PRESENT PIC 9.
           05 EMPLOYEEREC-SUSPIC PIC 9.
           05 EMPLOYEEREC-ABSENT-SUM PIC 999.
           05 EMPLOYEEREC-LATE-SUM PIC 999.
           05 EMPLOYEEREC-ABSENT PIC 9.
           05 EMPLOYEEREC-LATE PIC 9.
           05 EMPLOYEEREC-OVERTIME PIC 999.
       FD ATTENDANCE.
       01 ATTENDANCE-RECORD-DATE PIC 9999X99X99.
       01 ATTENDANCE-RECORD.
           05 ATTENDANCE-ID PIC 9999.
           05 ATTENDANCE-TYPR PIC X(6) VALUE SPACES.
           05 ATTENDANCE-DATE PIC 9999X99X99.
           05 ATTENDANCE-SYMBOL PIC X VALUE SPACES.
           05 ATTENDANCE-TIME.
               10 ATTENDANCE-TIME-HR PIC 99.
               10 ATTENDANCE-TIME-SYMBOL PIC X VALUE SPACES.
               10 ATTENDANCE-TIME-MIN PIC 99.
       FD MONTHLY-ATTENDANCE.
       01 MONTHLY-ATTENDANCEREC-DATE PIC 9999X99.
       01 MONTHLY-ATTENDANCEREC.
           05 MONTHLY-ATTENDANCEREC-ID PIC 9999.
           05 MONTHLY-ATTENDANCEREC-ABSENT PIC 999.
           05 MONTHLY-ATTENDANCEREC-LATE PIC 999.
           05 MONTHLY-ATTENDANCEREC-ORTIME PIC 999.
       FD MONTHLY-ATTENDANO.
       01 MONTHLY-ATTENDANOREC-DATE.
           05 MONTHLY-ATTENDANORCE-DATE-T PIC 9999X99.
           05 MONTHLY-ATTENDANORCE-DATE-CR PIC X.
       01 MONTHLY-ATTENDANOREC.
           05 MONTHLY-ATTENDANOREC-ID PIC 9999.
           05 MONTHLY-ATTENDANOREC-ABSENT PIC 999.
           05 MONTHLY-ATTENDANOREC-LATE PIC 999.
           05 MONTHLY-ATTENDANOREC-ORTIME PIC 999.
           05 MONTHLY-ATTENDANOREC-CR PIC X.
       FD SUMMARY.
       01 SUMMARY-T.
           05 SUMMARY-T-T PIC X(24) VALUE SPACES.
           05 SUMMARY-T-CR PIC X.
       01 SUMMARY-DATE.
           05 SUMMARY-DATE-T PIC X(6) VALUE SPACES.
           05 SUMMARY-DATE-VALUE PIC X(18) VALUE SPACES.
           05 SUMMARY-DATE-CR PIC X.
       01 SUMMARY-RECORD-T.
           05 SUMMARY-RECORD-T-T PIC X(58) VALUE SPACES.
           05 SUMMARY-RECORD-T-CR PIC X.
       01 SUMMARY-START.
           05 SUMMARY-START-T PIC X(62) VALUE SPACES.
           05 SUMMARY-START-CR PIC X.
       01 SUMMARY-RECORDS.
           05 SUMMARY-RECORDS-ID PIC 9999.
           05 SUMMARY-RECORDS-BALNK1 PIC X(5) VALUE SPACES.
           05 SUMMARY-RECORDS-LASTNAME PIC X(10) VALUE SPACES.
           05 SUMMARY-RECORDS-BALNK2 PIC X(1) VALUE SPACES.
           05 SUMMARY-RECORDS-FIRSTNAME PIC X(20) VALUE SPACES.
           05 SUMMARY-RECORDS-BALNK3 PIC X(1) VALUE SPACES.
           05 SUMMARY-RECORDS-DEPART PIC X(10) VALUE SPACES.
           05 SUMMARY-RECORDS-BALNK4 PIC X(1) VALUE SPACES.
           05 SUMMARY-RECORDS-STATUS PIC X(10) VALUE SPACES.
           05 SUMMARY-RECORDS-CR PIC X.
       01 SUMMARY-END.
           05 SUMMARY-END-T PIC X(62) VALUE SPACES.
           05 SUMMARY-END-CR PIC X.
       01 SUMMARY-PRESENT.
           05 SUMMARY-PRESENT-T PIC X(21) VALUE SPACES.
           05 SUMMARY-PRESENT-VALUE PIC ZZZ9.
           05 SUMMARY-PRESENT-CR PIC X.
       01 SUMMARY-ABSENT.
           05 SUMMARY-ABSENT-T PIC X(20) VALUE SPACES.
           05 SUMMARY-ABSENT-VALUE PIC ZZZ9.
           05 SUMMARY-ABSENT-CR PIC X.
       01 SUMMARY-LATE.
           05 SUMMARY-LATE-T PIC X(25) VALUE SPACES.
           05 SUMMARY-LATE-VALUE PIC ZZZ9.
           05 SUMMARY-LATE-CR PIC X.
       01 SUMMARY-SUSPIC.
           05 SUMMARY-SUSPIC-T PIC X(30) VALUE SPACES.
           05 SUMMARY-SUSPIC-VALUE PIC ZZZ9.
           05 SUMMARY-SUSPIC-CR PIC X.


       WORKING-STORAGE SECTION.
       01 WS-EMPLOYEE-INFORMATION.
           05 WS-EMPLOYEE-ID PIC 9999.
           05 WS-EMPLOYEE-NAME.
               10 WS-EMPLOYEE-LAST-NAME PIC X(10) VALUE SPACES.
               10 WS-EMPLOYEE-FIRST-NAME PIC X(20) VALUE SPACES.
           05 WS-EMPLOYEE-GENDER PIC X VALUE SPACES.
           05 WS-EMPLOYEE-BIRTH PIC 9999X99X99.
           05 WS-EMPLOYEE-HIRING-DATE PIC 9999X99X99.
           05 WS-EMPLOYEE-DEPART PIC XXX VALUE SPACES.
           05 WS-EMPLOYEE-SALARY PIC 9(6).
    
       01 WS-EMPLOYEEREC.
           05 WS-EMPLOYEEREC-DATE PIC 9999X99X99.
           05 WS-EMPLOYEEREC-ID PIC 9999 VALUE 0.
           05 WS-EMPLOYEEREC-LASTNAME PIC X(10) VALUE SPACES.
           05 WS-EMPLOYEEREC-FIRSTNAME PIC X(20) VALUE SPACES.
           05 WS-EMPLOYEEREC-DEPART PIC XXX VALUE SPACES.
           05 WS-EMPLOYEEREC-ARRIVE PIC 9 VALUE IS 0.
           05 WS-EMPLOYEEREC-LEAVE PIC 9 VALUE IS 0.
           05 WS-EMPLOYEEREC-PRESENT PIC 9 VALUE IS 0.
           05 WS-EMPLOYEEREC-SUSPIC PIC 9 VALUE IS 0.
           05 WS-EMPLOYEEREC-ABSENT-SUM PIC 999 VALUE IS 0.
           05 WS-EMPLOYEEREC-LATE-SUM PIC 999 VALUE IS 0.
           05 WS-EMPLOYEEREC-ABSENT PIC 9 VALUE IS 0.
           05 WS-EMPLOYEEREC-LATE PIC 9 VALUE IS 0.
           05 WS-EMPLOYEEREC-OVERTIME PIC 999 VALUE IS 0.
       01 WS-ATTENDANCE-RECORD-DATE PIC 9999X99X99.
       01 WS-ATTENDANCE.
           05 WS-ATTENDANCE-ID PIC 9999 VALUE IS 0.
           05 WS-ATTENDANCE-TYPE PIC X(6) VALUE SPACES.
           05 WS-ATTENDANCE-DATE PIC 9999X99X99.
           05 WS-ATTENDANCE-SYMPOL PIC X VALUE SPACES.
           05 WS-ATTENDANCE-TIME.
               10 WS-ATTENDANCE-TIME-HR PIC 99 VALUE IS 0.
               10 WS-ATTENDANCE-TIME-SYMBOL PIC X VALUE SPACES.
               10 WS-ATTENDANCE-TIME-MIN PIC 99 VALUE IS 0.
           05 WS-ATTENDANCE-OVERTIME PIC 9 VALUE 0.
       01 WS-MONTHLY-ATTENDANCEREC-DATE PIC 9999X99.
       01 WS-MONTHLY-ATTENDANCEREC.
           05 WS-MONTHLY-ATTENDANCEREC-ID PIC 9999 VALUE IS 0.
           05 WS-MONTHLY-ATTENDANCEREC-ABSENT PIC 999 VALUE IS 0.
           05 WS-MONTHLY-ATTENDANCEREC-LATE PIC 999 VALUE IS 0.
           05 WS-MONTHLY-ATTENDANCEREC-ORTIME PIC 999 VALUE IS 0.
       01 WS-MONTHLY-ATTENDANOREC-DATE.
           05 WS-MONTHLY-ATTENDANORCE-DATE-T PIC 9999X99.
           05 WS-MONTHLY-ATTENDANORCE-DATE-CR PIC X VALUE X"0D".
       01 WS-MONTHLY-ATTENDANOREC.
           05 WS-MONTHLY-ATTENDANOREC-ID PIC 9999.
           05 WS-MONTHLY-ATTENDANOREC-ABSENT PIC 999.
           05 WS-MONTHLY-ATTENDANOREC-LATE PIC 999.
           05 WS-MONTHLY-ATTENDANOREC-ORTIME PIC 999.
           05 WS-MONTHLY-ATTENDANOREC-CR PIC X VALUE X"0D".
       01 WS-SUMMARY-T.
           05 WS-SUMMARY-T-T PIC X(24) VALUE SPACES.
           05 WS-SUMMARY-T-CR PIC X.
       01 WS-SUMMARY-DATE.
           05 WS-SUMMARY-DATE-T PIC X(6) VALUE SPACES.
           05 WS-SUMMARY-DATE-VALUE PIC X(18) VALUE SPACES.
           05 WS-SUMMARY-DATE-CR PIC X VALUE X"0D".
       01 WS-SUMMARY-RECORD-T.
           05 WS-SUMMARY-RECORD-T-T PIC X(58) VALUE SPACES.
           05 WS-SUMMARY-RECORD-T-CR PIC X VALUE X"0D".
       01 WS-SUMMARY-START.
           05 WS-SUMMARY-START-T PIC X(62) VALUE SPACES.
           05 WS-SUMMARY-START-CR PIC X VALUE X"0D".
       01 WS-SUMMARY-RECORDS.
           05 WS-SUMMARY-RECORDS-ID PIC 9999.
           05 WS-SUMMARY-RECORDS-BALNK1 PIC X(5) VALUE SPACES.
           05 WS-SUMMARY-RECORDS-LASTNAME PIC X(10) VALUE SPACES.
           05 WS-SUMMARY-RECORDS-BALNK2 PIC X(1) VALUE SPACES.
           05 WS-SUMMARY-RECORDS-FIRSTNAME PIC X(20) VALUE SPACES.
           05 WS-SUMMARY-RECORDS-BALNK3 PIC X(1) VALUE SPACES.
           05 WS-SUMMARY-RECORDS-DEPART PIC X(10) VALUE SPACES.
           05 WS-SUMMARY-RECORDS-BALNK4 PIC X(1) VALUE SPACES.
           05 WS-SUMMARY-RECORDS-STATUS PIC X(10) VALUE SPACES.
           05 WS-SUMMARY-RECORDS-CR PIC X VALUE X"0D".
       01 WS-SUMMARY-END.
           05 WS-SUMMARY-END-T PIC X(62) VALUE SPACES.
           05 WS-SUMMARY-END-CR PIC X VALUE X"0D".
       01 WS-SUMMARY-PRESENT.
           05 WS-SUMMARY-PRESENT-T PIC X(21) VALUE SPACES.
           05 WS-SUMMARY-PRESENT-VALUE PIC ZZZ9.
           05 WS-SUMMARY-PRESENT-CR PIC X VALUE X"0D".
       01 WS-SUMMARY-ABSENT.
           05 WS-SUMMARY-ABSENT-T PIC X(20) VALUE SPACES.
           05 WS-SUMMARY-ABSENT-VALUE PIC ZZZ9.
           05 WS-SUMMARY-ABSENT-CR PIC X VALUE X"0D".
       01 WS-SUMMARY-LATE.
           05 WS-SUMMARY-LATE-T PIC X(25) VALUE SPACES.
           05 WS-SUMMARY-LATE-VALUE PIC ZZZ9.
           05 WS-SUMMARY-LATE-CR PIC X VALUE X"0D".
       01 WS-SUMMARY-SUSPIC.
           05 WS-SUMMARY-SUSPIC-T PIC X(30) VALUE SPACES.
           05 WS-SUMMARY-SUSPIC-VALUE PIC ZZZ9.
           05 WS-SUMMARY-SUSPIC-CR PIC X VALUE X"0D".
       01 ACCESSKEY PIC 9999 VALUE IS 0.
       01 EMPLOYEE-STATUS PIC 99 VALUE IS 0.
       01 RECORDTST-STATUS PIC 99 VALUE IS 0.
       01 ATTENDANCE-STATUS PIC 99 VALUE IS 0.
       01 MONTHLY-ATTENDANCE-STATUS PIC 99 VALUE IS 0.
       01 SUMMARY-STATUS PIC 99 VALUE IS 0.
       01 FLAG PIC 9 VALUE IS 0.
       01 RECORD-DATE.
           05 RECORD-DATE-YR PIC 9999.
           05 RECORD-DATE-SYMBOL1 PIC X VALUE SPACES.
           05 RECORD-DATE-MONTH PIC 99. 
           05 RECORD-DATE-SYMBOL2 PIC X VALUE SPACES.
           05 RECORD-DATE-DAY.
               10 RECORD-DATE-DAY1 PIC 9.
               10 RECORD-DATE-DAY2 PIC 9.
       01 WS-PRESENT PIC 9999.
       01 WS-ABSENT PIC 9999.
       01 WS-LATE PIC 9999.
       01 WS-SUSPIC PIC 9999.
       01 WS-LATE-CALC.
           05 WS-LATE-HR PIC S99.
           05 WS-LATE-MIN PIC S99.
           05 WS-LATE-SUM PIC S99.
       78 CR value X"0D".

       PROCEDURE DIVISION.
       MAIN-PARAGRAPH.
           DISPLAY '\r' CR 'CR'
           DISPLAY 'CR'
           OPEN OUTPUT RECORDTST.
           OPEN INPUT EMPLOYEES.
           OPEN INPUT MONTHLY-ATTENDANCE.
               READ MONTHLY-ATTENDANCE INTO 
               WS-MONTHLY-ATTENDANCEREC-DATE
               PERFORM READ-EMPLOYEES.
           CLOSE MONTHLY-ATTENDANCE.
           CLOSE EMPLOYEES.
           CLOSE RECORDTST.

           OPEN INPUT ATTENDANCE.
           OPEN I-O RECORDTST.
               READ ATTENDANCE INTO WS-ATTENDANCE-RECORD-DATE
               MOVE WS-ATTENDANCE-RECORD-DATE TO RECORD-DATE
               PERFORM READ-ATTENDANCE.
           CLOSE RECORDTST.
           CLOSE ATTENDANCE.
           
           OPEN I-O RECORDTST.
           OPEN OUTPUT SUMMARY.
           OPEN INPUT EMPLOYEES.   
               PERFORM WRITE-SUMMARY.
           CLOSE EMPLOYEES.
           CLOSE SUMMARY.
           CLOSE RECORDTST.
           
           OPEN INPUT RECORDTST.
           OPEN OUTPUT MONTHLY-ATTENDANO.
           OPEN INPUT EMPLOYEES.
               MOVE RECORD-DATE TO 
               MONTHLY-ATTENDANOREC-DATE
               MOVE CR TO MONTHLY-ATTENDANORCE-DATE-CR
               WRITE MONTHLY-ATTENDANOREC-DATE
               END-WRITE.
               PERFORM WRITE-MONTHLY-ATTENDANCE.
           CLOSE EMPLOYEES.
           CLOSE MONTHLY-ATTENDANO.
           CLOSE RECORDTST.

           STOP RUN.

       READ-EMPLOYEES.
           READ EMPLOYEES INTO WS-EMPLOYEE-INFORMATION
           IF EMPLOYEE-STATUS NOT = 10
               READ MONTHLY-ATTENDANCE INTO WS-MONTHLY-ATTENDANCEREC
               MOVE WS-EMPLOYEE-ID TO EMPLOYEEREC-ID
               MOVE WS-EMPLOYEE-LAST-NAME TO EMPLOYEEREC-LASTNAME
               MOVE WS-EMPLOYEE-FIRST-NAME TO EMPLOYEEREC-FIRSTNAME
               MOVE WS-EMPLOYEE-DEPART TO EMPLOYEEREC-DEPART
               MOVE 0 TO EMPLOYEEREC-ARRIVE
               MOVE 0 TO EMPLOYEEREC-LEAVE
               MOVE 0 TO EMPLOYEEREC-SUSPIC
               MOVE 0 TO EMPLOYEEREC-PRESENT
               MOVE 0 TO EMPLOYEEREC-ABSENT
               MOVE 0 TO EMPLOYEEREC-LATE
               MOVE WS-MONTHLY-ATTENDANCEREC-LATE 
               TO EMPLOYEEREC-LATE-SUM
               MOVE WS-MONTHLY-ATTENDANCEREC-ORTIME 
               TO EMPLOYEEREC-OVERTIME
               MOVE WS-MONTHLY-ATTENDANCEREC-ABSENT 
               TO EMPLOYEEREC-ABSENT-SUM
               WRITE EMPLOYEEREC
               END-WRITE
               DISPLAY EMPLOYEEREC
               GO TO READ-EMPLOYEES
           END-IF.
           
       READ-ATTENDANCE.
           READ ATTENDANCE INTO WS-ATTENDANCE
           IF ATTENDANCE-STATUS NOT = 10
               MOVE WS-ATTENDANCE-ID TO EMPLOYEEREC-ID
               READ RECORDTST RECORD INTO WS-EMPLOYEEREC
               KEY IS EMPLOYEEREC-ID
               IF WS-ATTENDANCE-TYPE='ARRIVE' THEN
                   MOVE 1 TO EMPLOYEEREC-ARRIVE
                   MOVE WS-ATTENDANCE-TIME-HR TO WS-LATE-HR
                   MOVE WS-ATTENDANCE-TIME-MIN TO WS-LATE-MIN                        
                   SUBTRACT 10 FROM WS-LATE-HR GIVING WS-LATE-HR
                   MULTIPLY WS-LATE-HR BY 4 GIVING WS-LATE-HR
                   DIVIDE WS-LATE-MIN BY 15 GIVING WS-LATE-MIN
                   ADD WS-LATE-HR TO WS-LATE-MIN GIVING WS-LATE-SUM
                   IF WS-LATE-SUM >=1
                       ADD WS-LATE-SUM TO EMPLOYEEREC-LATE-SUM 
                       GIVING EMPLOYEEREC-LATE-SUM
                       ADD 1 TO WS-LATE GIVING WS-LATE
                       ADD 1 TO EMPLOYEEREC-LATE GIVING EMPLOYEEREC-LATE
                   END-IF
               END-IF
               IF WS-ATTENDANCE-TYPE='LEAVE' THEN
                   MOVE 1 TO EMPLOYEEREC-LEAVE
                   IF WS-EMPLOYEEREC-ARRIVE = 1
                       IF WS-ATTENDANCE-TIME-HR>17 THEN 
                           SUBTRACT 17 FROM WS-ATTENDANCE-TIME-HR
                           GIVING WS-ATTENDANCE-OVERTIME
                           ADD WS-ATTENDANCE-OVERTIME 
                           TO EMPLOYEEREC-OVERTIME 
                           GIVING EMPLOYEEREC-OVERTIME
                       END-IF
                   END-IF
               END-IF
               REWRITE EMPLOYEEREC
               END-REWRITE
               GO TO READ-ATTENDANCE
           END-IF.
       WRITE-MONTHLY-ATTENDANCE.
           READ EMPLOYEES INTO WS-EMPLOYEE-INFORMATION
           IF EMPLOYEE-STATUS NOT = 10
               MOVE WS-EMPLOYEE-ID TO EMPLOYEEREC-ID
               READ RECORDTST RECORD INTO WS-EMPLOYEEREC
               KEY IS EMPLOYEEREC-ID
               MOVE WS-EMPLOYEEREC-ID 
               TO MONTHLY-ATTENDANOREC-ID
               MOVE WS-EMPLOYEEREC-ABSENT-SUM 
               TO MONTHLY-ATTENDANOREC-ABSENT
               MOVE WS-EMPLOYEEREC-LATE-SUM 
               TO MONTHLY-ATTENDANOREC-LATE
               MOVE WS-EMPLOYEEREC-OVERTIME 
               TO MONTHLY-ATTENDANOREC-ORTIME
               MOVE CR TO MONTHLY-ATTENDANOREC-CR
               WRITE MONTHLY-ATTENDANOREC
               END-WRITE
               GO TO WRITE-MONTHLY-ATTENDANCE
           END-IF.
       WRITE-DATE.
           IF RECORD-DATE-MONTH = 1
               IF RECORD-DATE-DAY < 10
               STRING 'January 'RECORD-DATE-DAY2', 'RECORD-DATE-YR CR
               INTO SUMMARY-DATE-VALUE
               END-IF
               IF RECORD-DATE-DAY >= 10
               STRING 'January 'RECORD-DATE-DAY', 'RECORD-DATE-YR CR
               INTO SUMMARY-DATE-VALUE
               END-IF
           END-IF
           IF RECORD-DATE-MONTH = 2
               IF RECORD-DATE-DAY < 10
               STRING 'February 'RECORD-DATE-DAY2', 'RECORD-DATE-YR CR
               INTO SUMMARY-DATE-VALUE
               END-IF
               IF RECORD-DATE-DAY >= 10
               STRING 'February 'RECORD-DATE-DAY', 'RECORD-DATE-YR CR
               INTO SUMMARY-DATE-VALUE
               END-IF
           END-IF
           IF RECORD-DATE-MONTH = 3
               IF RECORD-DATE-DAY < 10
               STRING 'March 'RECORD-DATE-DAY2', 'RECORD-DATE-YR CR
               INTO SUMMARY-DATE-VALUE
               END-IF
               IF RECORD-DATE-DAY >= 10
               STRING 'March 'RECORD-DATE-DAY', 'RECORD-DATE-YR CR
               INTO SUMMARY-DATE-VALUE
               END-IF
           END-IF
           IF RECORD-DATE-MONTH = 4
               IF RECORD-DATE-DAY < 10
               STRING 'April 'RECORD-DATE-DAY2', 'RECORD-DATE-YR CR
               INTO SUMMARY-DATE-VALUE
               END-IF
               IF RECORD-DATE-DAY >= 10
               STRING 'April 'RECORD-DATE-DAY', 'RECORD-DATE-YR CR
               INTO SUMMARY-DATE-VALUE
               END-IF
           END-IF
           IF RECORD-DATE-MONTH = 5
               IF RECORD-DATE-DAY < 10
               STRING 'May 'RECORD-DATE-DAY2', 'RECORD-DATE-YR CR
               INTO SUMMARY-DATE-VALUE
               END-IF
               IF RECORD-DATE-DAY >= 10
               STRING 'May 'RECORD-DATE-DAY', 'RECORD-DATE-YR CR
               INTO SUMMARY-DATE-VALUE
               END-IF
           END-IF
           IF RECORD-DATE-MONTH = 6
               IF RECORD-DATE-DAY < 10
               STRING 'June 'RECORD-DATE-DAY2', 'RECORD-DATE-YR CR
               INTO SUMMARY-DATE-VALUE
               END-IF
               IF RECORD-DATE-DAY >= 10
               STRING 'June 'RECORD-DATE-DAY', 'RECORD-DATE-YR CR
               INTO SUMMARY-DATE-VALUE
               END-IF
           END-IF
           IF RECORD-DATE-MONTH = 7
               IF RECORD-DATE-DAY < 10
               STRING 'July 'RECORD-DATE-DAY2', 'RECORD-DATE-YR CR
               INTO SUMMARY-DATE-VALUE
               END-IF
               IF RECORD-DATE-DAY >= 10
               STRING 'July 'RECORD-DATE-DAY', 'RECORD-DATE-YR CR
               INTO SUMMARY-DATE-VALUE
               END-IF
           END-IF
           IF RECORD-DATE-MONTH = 8
               IF RECORD-DATE-DAY < 10
               STRING 'August 'RECORD-DATE-DAY2', 'RECORD-DATE-YR CR
               INTO SUMMARY-DATE-VALUE
               END-IF
               IF RECORD-DATE-DAY >= 10
               STRING 'August 'RECORD-DATE-DAY', 'RECORD-DATE-YR CR
               INTO SUMMARY-DATE-VALUE
               END-IF
           END-IF
           IF RECORD-DATE-MONTH = 9
               IF RECORD-DATE-DAY < 10
               STRING 'September 'RECORD-DATE-DAY2', 'RECORD-DATE-YR CR
               INTO SUMMARY-DATE-VALUE
               END-IF
               IF RECORD-DATE-DAY >= 10
               STRING 'September 'RECORD-DATE-DAY', 'RECORD-DATE-YR CR
               INTO SUMMARY-DATE-VALUE
               END-IF
           END-IF
           IF RECORD-DATE-MONTH = 10
               IF RECORD-DATE-DAY < 10
               STRING 'October 'RECORD-DATE-DAY2', 'RECORD-DATE-YR CR
               INTO SUMMARY-DATE-VALUE
               END-IF
               IF RECORD-DATE-DAY >= 10
               STRING 'October 'RECORD-DATE-DAY', 'RECORD-DATE-YR CR
               INTO SUMMARY-DATE-VALUE
               END-IF
           END-IF
           IF RECORD-DATE-MONTH = 11
               IF RECORD-DATE-DAY < 10
               STRING 'November 'RECORD-DATE-DAY2', 'RECORD-DATE-YR CR
               INTO SUMMARY-DATE-VALUE
               END-IF
               IF RECORD-DATE-DAY >= 10
               STRING 'November 'RECORD-DATE-DAY', 'RECORD-DATE-YR CR
               INTO SUMMARY-DATE-VALUE
               END-IF
           END-IF
           IF RECORD-DATE-MONTH = 12
               IF RECORD-DATE-DAY < 10
               STRING 'December 'RECORD-DATE-DAY2', 'RECORD-DATE-YR CR
               INTO SUMMARY-DATE-VALUE
               END-IF
               IF RECORD-DATE-DAY >= 10
               STRING 'December 'RECORD-DATE-DAY', 'RECORD-DATE-YR CR
               INTO SUMMARY-DATE-VALUE
               END-IF
           END-IF.
       WRITE-SUMMARY.
           MOVE '                        ' TO SUMMARY-T
           MOVE 'Daily Attendance Summary' TO SUMMARY-T
           MOVE CR TO SUMMARY-T-CR
           WRITE SUMMARY-T

           MOVE '                        ' TO SUMMARY-DATE
           MOVE 'Date: ' TO SUMMARY-DATE-T
           PERFORM WRITE-DATE.
           MOVE CR TO SUMMARY-DATE-CR
           WRITE SUMMARY-DATE
           
           MOVE 
            'Staff-ID Name                            Department Status'
           TO SUMMARY-RECORD-T
           MOVE CR TO SUMMARY-RECORD-T-CR
           WRITE SUMMARY-RECORD-T

           MOVE 
        '--------------------------------------------------------------'
           TO SUMMARY-START
           MOVE CR TO SUMMARY-START-CR
           WRITE SUMMARY-START

           PERFORM WRITE-SUMMARY-RECORD.

           MOVE 
        '--------------------------------------------------------------'
           TO SUMMARY-END
           MOVE CR TO SUMMARY-END-CR
           WRITE SUMMARY-END
           
           MOVE 'Number of Presences: ' TO SUMMARY-PRESENT-T
           MOVE WS-PRESENT TO SUMMARY-PRESENT-VALUE
           MOVE CR TO SUMMARY-PRESENT-CR
           WRITE SUMMARY-PRESENT
           MOVE 'Number of Absences: ' TO SUMMARY-ABSENT-T
           MOVE WS-ABSENT TO SUMMARY-ABSENT-VALUE
           MOVE CR TO SUMMARY-ABSENT-CR
           WRITE SUMMARY-ABSENT
           MOVE 'Number of Late Arrivals: ' TO SUMMARY-LATE-T
           MOVE WS-LATE TO SUMMARY-LATE-VALUE
           MOVE CR TO SUMMARY-LATE-CR
           WRITE SUMMARY-LATE
           MOVE 'Number of Suspicious Records: ' TO SUMMARY-SUSPIC-T
           MOVE WS-SUSPIC TO SUMMARY-SUSPIC-VALUE
           MOVE CR TO SUMMARY-SUSPIC-CR
           WRITE SUMMARY-SUSPIC
           END-WRITE.

       WRITE-SUMMARY-RECORD.
           READ EMPLOYEES INTO WS-EMPLOYEE-INFORMATION
           IF EMPLOYEE-STATUS NOT = 10
               MOVE WS-EMPLOYEE-ID TO EMPLOYEEREC-ID
               READ RECORDTST RECORD INTO WS-EMPLOYEEREC
               KEY IS EMPLOYEEREC-ID
               PERFORM CHECK-FLAG
               MOVE WS-EMPLOYEEREC-PRESENT TO EMPLOYEEREC-PRESENT
               MOVE WS-EMPLOYEEREC-SUSPIC TO EMPLOYEEREC-SUSPIC
               MOVE WS-EMPLOYEEREC-ABSENT-SUM TO EMPLOYEEREC-ABSENT-SUM
               MOVE WS-EMPLOYEEREC-ABSENT TO EMPLOYEEREC-ABSENT
               REWRITE EMPLOYEEREC
               END-REWRITE
               MOVE 0 TO FLAG
               ADD WS-EMPLOYEEREC-ARRIVE TO FLAG GIVING FLAG
               ADD WS-EMPLOYEEREC-LEAVE TO FLAG GIVING FLAG
               IF WS-EMPLOYEEREC-ABSENT = 1
                   MOVE WS-EMPLOYEEREC-ID TO SUMMARY-RECORDS-ID
                   MOVE '     ' TO SUMMARY-RECORDS-BALNK1
                   MOVE WS-EMPLOYEEREC-LASTNAME 
                   TO SUMMARY-RECORDS-LASTNAME
                   MOVE ' '  TO SUMMARY-RECORDS-BALNK2
                   MOVE WS-EMPLOYEEREC-FIRSTNAME
                   TO SUMMARY-RECORDS-FIRSTNAME
                   MOVE ' '  TO SUMMARY-RECORDS-BALNK3
                   MOVE WS-EMPLOYEEREC-DEPART
                   TO SUMMARY-RECORDS-DEPART
                   MOVE ' '  TO SUMMARY-RECORDS-BALNK4
                   MOVE 'ABSENCE   ' TO SUMMARY-RECORDS-STATUS
               END-IF
               IF WS-EMPLOYEEREC-SUSPIC = 1
                   MOVE WS-EMPLOYEEREC-ID TO SUMMARY-RECORDS-ID
                   MOVE '     ' TO SUMMARY-RECORDS-BALNK1
                   MOVE WS-EMPLOYEEREC-LASTNAME 
                   TO SUMMARY-RECORDS-LASTNAME
                   MOVE ' '  TO SUMMARY-RECORDS-BALNK2
                   MOVE WS-EMPLOYEEREC-FIRSTNAME
                   TO SUMMARY-RECORDS-FIRSTNAME
                   MOVE ' '  TO SUMMARY-RECORDS-BALNK3
                   MOVE WS-EMPLOYEEREC-DEPART
                   TO SUMMARY-RECORDS-DEPART
                   MOVE ' '  TO SUMMARY-RECORDS-BALNK4
                   MOVE 'SUSPICIOUS' TO SUMMARY-RECORDS-STATUS
               END-IF
               IF WS-EMPLOYEEREC-SUSPIC NOT = 1
                   IF WS-EMPLOYEEREC-LATE = 1
                       MOVE WS-EMPLOYEEREC-ID TO SUMMARY-RECORDS-ID
                       MOVE '     ' TO SUMMARY-RECORDS-BALNK1
                       MOVE WS-EMPLOYEEREC-LASTNAME 
                       TO SUMMARY-RECORDS-LASTNAME
                       MOVE ' '  TO SUMMARY-RECORDS-BALNK2
                       MOVE WS-EMPLOYEEREC-FIRSTNAME
                       TO SUMMARY-RECORDS-FIRSTNAME
                       MOVE ' '  TO SUMMARY-RECORDS-BALNK3
                       MOVE WS-EMPLOYEEREC-DEPART
                       TO SUMMARY-RECORDS-DEPART
                       MOVE ' '  TO SUMMARY-RECORDS-BALNK4
                       MOVE 'LATE      ' TO SUMMARY-RECORDS-STATUS
                   END-IF
                   IF WS-EMPLOYEEREC-LATE NOT = 1
                       IF WS-EMPLOYEEREC-PRESENT = 1
                           MOVE WS-EMPLOYEEREC-ID TO SUMMARY-RECORDS-ID
                           MOVE '     ' TO SUMMARY-RECORDS-BALNK1
                           MOVE WS-EMPLOYEEREC-LASTNAME 
                           TO SUMMARY-RECORDS-LASTNAME
                           MOVE ' '  TO SUMMARY-RECORDS-BALNK2
                           MOVE WS-EMPLOYEEREC-FIRSTNAME
                           TO SUMMARY-RECORDS-FIRSTNAME
                           MOVE ' '  TO SUMMARY-RECORDS-BALNK3
                           MOVE WS-EMPLOYEEREC-DEPART
                           TO SUMMARY-RECORDS-DEPART
                           MOVE ' '  TO SUMMARY-RECORDS-BALNK4
                           MOVE 'PRESENT   ' TO SUMMARY-RECORDS-STATUS
                       END-IF
                   END-IF
                   MOVE CR TO SUMMARY-RECORDS-CR
                   WRITE SUMMARY-RECORDS
                   END-WRITE
               END-IF
               GO TO WRITE-SUMMARY-RECORD
           END-IF.
       CHECK-FLAG.
           MOVE 0 TO FLAG
           ADD WS-EMPLOYEEREC-ARRIVE TO FLAG GIVING FLAG
           ADD WS-EMPLOYEEREC-LEAVE TO FLAG GIVING FLAG
           IF FLAG = 0
               ADD 1 TO WS-ABSENT GIVING WS-ABSENT
               ADD 1 TO WS-EMPLOYEEREC-ABSENT-SUM
               GIVING WS-EMPLOYEEREC-ABSENT-SUM
               ADD 1 TO WS-EMPLOYEEREC-ABSENT
               GIVING WS-EMPLOYEEREC-ABSENT
           END-IF
           IF FLAG = 1
               ADD 1 TO WS-SUSPIC GIVING WS-SUSPIC
               ADD 1 TO WS-EMPLOYEEREC-SUSPIC
               GIVING WS-EMPLOYEEREC-SUSPIC
           END-IF
           IF FLAG = 2
               IF WS-EMPLOYEEREC-LATE NOT = 1
                   ADD 1 TO WS-PRESENT GIVING WS-PRESENT
                   ADD 1 TO WS-EMPLOYEEREC-PRESENT
                   GIVING WS-EMPLOYEEREC-PRESENT
               END-IF
           END-IF.
